Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: Normally you have to type exactly what you want to find. If you don't care about upper or lowercase in a word, set the 'ignorecase' option: >
es_es: Normalmente tiene que teclear exactamente lo que quieres encontrar. Si no le importa si los caracteres están en mayúscula/minúscula, active 'ignorecase': >

source: If you now search for "word", it will also match "Word" and "WORD". To match case again: >
es_es: Si ahora busca «palabra», también le identificará «Palabra» y «PALABRA». Para concordar con mayúsculas y minúsculas de nuevo: >

source: /one /two /three
es_es: /uno /dos /tres

source: Now let's start searching by typing a simple "/" without pressing <Enter>. If you press <Up> (the cursor key), Vim puts "/three" on the command line. Pressing <Enter> at this point searches for three. If you do not press <Enter>, but press <Up> instead, Vim changes the prompt to "/two". Another press of <Up> moves you to "/one". You can also use the <Down> cursor key to move through the history of search commands in the other direction.
es_es: Ahora comience a buscar tecleando un simple «/» sin presionar <Intro>. Si presiona <Arriba> (la tecla de cursor), Vim introduce «tres» en la línea de órdenes. Presionar <Intro> en este punto busca «tres». Si no pulsa <Intro> y presiona <Arriba>, Vim cambia el texto a «/dos». Si pulsa de nuevo <Arriba>, verá «/uno». Puede usar también la tecla de cursor <Abajo> para moverse por el historial de órdenes de búsqueda en la otra dirección.

source: If you know what a previously used pattern starts with, and you want to use it again, type that character before pressing <Up>. With the previous example, you can type "/o<Up>" and Vim will put "/one" on the command line.
es_es: Si sabe cómo comienza una de sus búsquedas anteriores y la quiere usar de nuevo, introduzca ese carácter antes de presionar <Arriba>. En el ejemplo anterior, teclea «/u<Arriba>» y Vim pondrá «/uno» en la línea de órdenes.

source: The commands starting with ":" also have a history. That allows you to recall a previous command and execute it again. These two histories are separate.
es_es: Las órdenes que comienzan con «:» también tienen un historial. Esto ayuda a reutilizar órdenes que ha usado antes. Estos dos historiales son independientes.

source: If you type "/the" it will also match "there". To only find words that end in "the" use: >
es_es: Si teclea «/el» también le identificará «ellos». Para buscar sólo palabras que terminen en «el», use: >

source: /the\>
es_es: /el\>

source: The "\>" item is a special marker that only matches at the end of a word. Similarly "\<" only matches at the begin of a word. Thus to search for the word "the" only: >
es_es: El elemento z\>» es un marcador especial que sólo identifica el final de una palabra. De igual modo, «\<» identifica el comienzo de una palabra. Por lo tanto para buscar únicamente la palabra completa: >

source: /\<the\>
es_es: /\<el\>

source: This does not match "there" or "soothe". Notice that the "*" and "#" commands use these start-of-word and end-of-word markers to only find whole words (you can use "g*" and "g#" to match partial words).
es_es: Esto no encontrará «ellos» o «mantel». Fíjese en que las órdenes «*» y «#» usan estos marcadores de comienzo y final de palabra para encontrar únicamente palabras completas (puede usar «g*» y «g#» para concordancias parciales).

source: While editing a program you see a variable called "nr". You want to check where it's used. You could move the cursor to "nr" and use the "*" command and press "n" to go along all the matches. There is another way. Type this command: >
es_es: Al editar un programa verá una variable llamada «nr». Quiere comprobar dónde se usa. Puede mover el cursor a «nr» y usar la orden «*» y presionar «n» para ir de cadena en cadena. Pero hay otro modo. Teclee la siguiente orden: >

source: If you now search for "nr", Vim will highlight all matches. That is a very good way to see where the variable is used, without the need to type commands. To switch this off: >
es_es: Si ahora busca «nr», Vim le destacará todas las concordancias. Este es un método muy bueno para ver dónde se emplea la variable, sin la necesidad de «n». Para desactivarlo: >

source: Then you need to switch it on again if you want to use it for the next search command. If you only want to remove the highlighting, use this command: >
es_es: Necesita activarlo de nuevo si quiere usarlo para la siguiente orden de búsqueda. Si sólo quiere que desaparezca, use: >

source: This doesn't reset the option. Instead, it disables the highlighting. As soon as you execute a search command, the highlighting will be used again. Also for the "n" and "N" commands.
es_es: Esto no modifica la opción. En su lugar, quita las marcas. Tan pronto como vuelva a buscar algo, las marcas se volverán a emplear. También ocurrirá con las órdenes «n» y «N».

source: There are a few options that change how searching works. These are the essential ones: > :set incsearch
es_es: Hay algunas opciones que modifican el modo en el que la búsqueda se realiza. Estas son las esenciales: > :set incsearch

source: This makes Vim display the match for the string while you are still typing it. Use this to check if the right match will be found. Then press <Enter> to really jump to that location. Or type more to change the search string. > :set nowrapscan
es_es: Esto hace que Vim muestre la concordancia de la cadena mientras aún la teclea. Use esto para ver si la cadena correcta será encontrada. Pulse luego <Intro> para saltar a su localización. Puede también modificar la cadena. > :set nowrapscan

source: This stops the search at the end of the file. Or, when you are searching backwards, at the start of the file. The 'wrapscan' option is on by default, thus searching wraps around the end of the file.
es_es: Esto detiene la búsqueda al final del archivo. O, cuando buscas hacia atrás, al comienzo del archivo. La opción 'wrapscan' se activa por omisión, por lo que buscará dando la vuelta al texto.

source: If you like one of the options mentioned before, and set it each time you use Vim, you can put the command in your Vim startup file. Edit the file, as mentioned at |not-compatible|. Or use this command to find out where it is: >
es_es: Si le gusta alguna de las opciones mencionadas previamente, y la activa cada vez que usa Vim, puede poner la orden en el archivo de arranque de Vim. Edite el archivo, como se describe en |not-compatible|. Puede usar la siguiente orden para ver dónde se encuentra: >

source: Then add a line with the command to set the option, just like you typed it in Vim. Example: >
es_es: Ahora añada una línea con la orden para activar la opción, del mismo modo que lo introdujo en Vim. Por ejemplo: >

source: *03.9* Simple search patterns
es_es: *03.9* Patrones sencillos de búsqueda

source: The ^ character matches the beginning of a line. On an English-US keyboard you find it above the 6. The pattern "include" matches the word include anywhere on the line. But the pattern "^include" matches the word include only if it is at the beginning of a line. The $ character matches the end of a line. Therefore, "was$" matches the word was only if it is at the end of a line.
es_es: El carácter «^» identifica el comienzo de línea. En un teclado Español-España lo encontrará a la derecha de la «p». El patrón «include» concuerda la palabra «include» en cualquier parte de una línea. Pero el patrón «^include» concuerda la palabra «include» sólo si se encuentra al comienzo de la línea. El carácter $ coincide el final de línea. Por lo tanto, "era$" concuerda la palabra «era» sólo si esta se encuentra al final de una línea.

source: the solder holding one of the chips melted and the ~ xxx xxx xxx
es_es: que este sobredicho hidalgo, los ratos que estaba ocioso (que ~ xxx xxx xxx

source: the solder holding one of the chips melted and the ~ xxx
es_es: que este sobredicho hidalgo, los ratos que estaba ocioso (que~ xxx

source: And with "/^the" we find this one: the solder holding one of the chips melted and the ~ xxx
es_es: Y con «/^que» encontramos el siguiente: que este sobredicho hidalgo, los ratos que estaba ocioso (que ~ xxx

source: You can try searching with "/^the$", it will only match a single line consisting of "the". White space does matter here, thus if a line contains a space after the word, like "the ", the pattern will not match.
es_es: Puede intentar buscar con «/^que$», que sólo se emparejará con una única línea consistente en «que». El espacio en blanco se considera, por lo que si contiene un espacio tras la palabra, como «que», el patrón no coincide.

source: If you really want to match a dot, you must avoid its special meaning by putting a backslash before it. If you search for "ter.", you will find these matches:
es_es: Si realmente desea coinciordar un punto, debe suprimir su significado especial poniendo antes una barra inversa. Si busca «an.», obtendría las siguientes coincidencias:

source: *03.10* Using marks
es_es: *03.10* Uso de marcadores o marcas

source: When you make a jump to a position with the "G" command, Vim remembers the position from before this jump. This position is called a mark. To go back where you came from, use this command: >
es_es: Cuando hace un salto a una posición con la orden «G», Vim recuerda la posición antes de el salto. Esta posición se llama marca o marcador. Para volver al punto anterior del que te encuentras, use la siguiente orden: >

source: This ` is a backtick or open single-quote character. If you use the same command a second time you will jump back again. That's because the ` command is a jump itself, and the position from before this jump is remembered.
es_es: Esta ` es una tilde invertida o carácter de abrir comillas simples. Si usa esta misma orden de nuevo, volverá hacia atrás. Esto es porque la orden «`» es un salto en si mismo, y la posición anterior al salto también se registra.

source: The `` command jumps back and forth, between two points. The CTRL-O command jumps to older positions (Hint: O for older). CTRL-I then jumps back to newer positions (Hint: I is just next to O on the keyboard). Consider this sequence of commands: >
es_es: La orden «``» salta hacia atrás y hacia delante, entre dos puntos. La orden CTRL-O salta a posiciones anteriores (Truco: O de «older», viejo). CTRL-I salta de vuelta a posiciones más recientes (Truco: la I está justo al lado de la O en el teclado). Observe esta secuencia de órdenes: >

source: 33G /^The CTRL-O
es_es: 33G /^El CTRL-O

source: You first jump to line 33, then search for a line that starts with "The". Then with CTRL-O you jump back to line 33. Another CTRL-O takes you back to where you started. If you now use CTRL-I you jump to line 33 again. And to the match for "The" with another CTRL-I.
es_es: Primero salta a la línea 33, luego salta a una línea que comienza con «El». Entonces vuelva con CTRL-O a la línea 33. Otro CTRL-O le devuelve a donde comenzó. Si ahora usa CTRL-I, volverá a la línea 33. Con otro CTRL-I vuelve al «El» identificado.

source: | example text ^ | 33G | example text | CTRL-O | CTRL-I | example text | | V line 33 text ^ V | example text | | /^The | example text | CTRL-O | CTRL-I V There you are | V example text
es_es: | texto de ejemplo ^ | 33G | texto de ejemplo | CTRL-O | CTRL-I | texto de ejemplo | | V texto de la línea 33 ^ V | texto de ejemplo | | /^The | texto de ejemplo | CTRL-O | CTRL-I V Aquí estás | V texto de ejemplo

source: Note: CTRL-I is the same as <Tab>.
es_es: Nota: CTRL-I hace lo mismo que <Tab>.

source: The ":jumps" command gives a list of positions you jumped to. The entry which you used last is marked with a ">".
es_es: La orden «:jumps» le da una lista de posiciones a las que ha saltado. La última entrada que ha usado está marcada con un «>».

source: NAMED MARKS *bookmark*
es_es: MARCADORES *bookmark*

source: Vim enables you to place your own marks in the text. The command "ma" marks the place under the cursor as mark a. You can place 26 marks (a through z) in your text. You can't see them, it's just a position that Vim remembers. To go to a mark, use the command `{mark}, where {mark} is the mark letter. Thus to move to the a mark: > `a
es_es: Vim le permite colocar sus propias marcas en el texto. La orden «m» marca el lugar sobre el que se encuentra el cursor como «a». Puede poner hasta 26 marcas (a-z). No puede verlas, son simplemente posiciones que Vim recuerda. Para ir a una marca, use la orden `{marca}, donde {marca} es la letra del marcador. Para moverse a la marca «a»: > `a

source: The command 'mark (single quotation mark, or apostrophe) moves you to the beginning of the line containing the mark. This differs from the `mark command, which moves you to marked column.
es_es: La orden '{marca} (apóstrofe o signo de comillas simples) le lleva al comienzo de la línea que contiene la marca. Esto difiere de la orden `{marca}, que le desplaza a la columna donde se hizo la marca.

source: The marks can be very useful when working on two related parts in a file. Suppose you have some text near the start of the file you need to look at, while working on some text near the end of the file. Move to the text at the start and place the s (start) mark there: >
es_es: Los marcadores pueden ser muy útiles cuando se trabaja en dos partes del archivo relacionadas. Suponga que tiene un texto cerca del comienzo del archivo que necesitas mirar mientras trabaja en otra parte. Vaya al texto del comienzo y ponga un marcador «s» (start) allí: >

source: Then you can use '' to jump back to where you were, or 'e to jump to the text you were working on at the end. There is nothing special about using s for start and e for end, they are just easy to remember.
es_es: Luego puede usar '' para saltar de vuelta a donde estaba, o 'e para saltar al texto donde estuvo trabajando. No hay nada especial en usar s para el comienzo o e para el final, son simplemente fáciles de recordar.

source: You will notice a few special marks. These include:
es_es: Verá unos cuantos marcadores especiales. Entre ellos:

source: ' The cursor position before doing a jump " The cursor position when last editing the file [ Start of the last change ] End of the last change
es_es: ' La posición del cursor antes del último salto " La posición del cursor antes de la última edición [ Comienzo del último cambio ] Final del último cambio

source: *usr_27.txt* For Vim version 7.3. Last change: 2010 Mar 28
es_es: *usr_27.esx* Para Vim version 7.3. Último cambio: 28/3/2010

source: Search commands and patterns
es_es: Órdenes y patrones de búsqueda

source: |27.1| Ignoring case |27.2| Wrapping around the file end |27.3| Offsets |27.4| Matching multiple times |27.5| Alternatives |27.6| Character ranges |27.7| Character classes |27.8| Matching a line break |27.9| Examples
es_es: |27.1| Ignorar la distinción entre mayúsculas y minúsculas |27.2| Justificar el fin del archivo |27.3| Dirección relativa («offsets») |27.4| Emparejar varios elementos |27.5| Alternativas |27.6| Rangos de caracteres |27.7| Clases de caracteres |27.8| Coincidir con un salto de línea |27.9| Ejemplos

source: Next chapter: |usr_28.txt| Folding Previous chapter: |usr_26.txt| Repeating Table of contents: |usr_toc.txt|
es_es: Siguiente capítulo: |usr_28.txt| Plegar Capítulo anterior: |usr_25.esx| Repetición Tabla de contenidos: |usr_toc.esx|

source: *27.1* Ignoring case
es_es: *27.1* Ignorar la distinción entre mayúsculas y minúsculas

source: By default, Vim's searches are case sensitive. Therefore, "include", "INCLUDE", and "Include" are three different words and a search will match only one of them. Now switch on the 'ignorecase' option: >
es_es: Vim distingue entre mayúsculas y minúsculas al realizar un búsqueda de forma predeterminada. «INCLUDE», «Include» e «include» son por ello tres palabras distintas, y una búsqueda encontraría sólo una de ellas. Active ahora la opción 'ignorecase': >

source: But let's keep it set, and search for "INCLUDE". It will match exactly the same text as "include" did. Now set the 'smartcase' option: >
es_es: Vamos a dejar esta opción activada, y realizar una búsqueda de «INCLUDE». Encontrará el mismo texto que «include». Active ahora la opción 'smartcase': >

source: If you have a pattern with at least one uppercase character, the search becomes case sensitive. The idea is that you didn't have to type that uppercase character, so you must have done it because you wanted case to match. That's smart! With these two options set you find the following matches:
es_es: Si tiene un patrón con al menos un carácter en mayúscula, la búsqueda no distinguirá entre mayúsculas y minúsculas. La idea es que no necesitaba escribir ese carácter en mayúscula, y que por ello lo que deseaba era encontrar coincidencias con distinción entre mayúsculas y minúsculas. ¡Qué inteligente! Obtendría las siguientes coincidencias de activar ambas opciones:

source: pattern matches ~ word word, Word, WORD, WoRd, etc. Word Word WORD WORD WoRd WoRd
es_es: patrón coincidencias ~ palabra palabra, Palabra, PALABRA, PaLaBRa etc. Palabra Palabra PALABRA PALABRA PaLaBRa PaLaBRa

source: If you want to ignore case for one specific pattern, you can do this by prepending the "\c" string. Using "\C" will make the pattern to match case. This overrules the 'ignorecase' and 'smartcase' options, when "\c" or "\C" is used their value doesn't matter.
es_es: Puede anexar la cadena «\c» si desea ignorar esta distinción para un patrón en particular. Usar «\C» activará la distinción. Esto invalida las opciones 'ignorecase' y 'smartcase', ya que usar «\c» o «\C» obvia el valor de estas opciones.

source: pattern matches ~ \Cword word \CWord Word \cword word, Word, WORD, WoRd, etc. \cWord word, Word, WORD, WoRd, etc.
es_es: patrón coincidencias ~ \Cpalabra palabra \CPalabra Palabra \cpalabra palabra, Palabra, PALABRA, PaLaBrA, etc. \cPalabra palabra, Palabra, PALABRA, PaLaBrA, etc.

source: A big advantage of using "\c" and "\C" is that it sticks with the pattern. Thus if you repeat a pattern from the search history, the same will happen, no matter if 'ignorecase' or 'smartcase' was changed.
es_es: Una enorme ventaja de usar «\c» y «\C» es que se mantienen ligadas al patrón. Por ello, si repite un patrón desde el registro de búsquedas obtendrá el mismo resultado sin importar si cualquier cambio de 'ignorecase' y 'smartcase'.

source: Note: The use of "\" items in search patterns depends on the 'magic' option. In this chapter we will assume 'magic' is on, because that is the standard and recommended setting. If you would change 'magic', many search patterns would suddenly become invalid.
es_es: Nota: El uso del elemento «\» en patrones de búsqueda depende de la opción 'magic'. En estos capítulos daremos por sentado que 'magic' está activado, ya que es la configuración estándar y recomendad. De cambiar 'magic' muchos patrones de búsqueda no serían válidos.

source: Note: If your search takes much longer than you expected, you can interrupt it with CTRL-C on Unix and CTRL-Break on MS-DOS and MS-Windows.
es_es: Nota: Si la búsqueda lleva más tiempo del esperado, puede interrumpir esta con CTRL-C en Unix y CTRL-Break en MS-DOS y MS-Windows.

source: *27.2* Wrapping around the file end
es_es: *27.2* Justificar el fin del archivo

source: By default, a forward search starts searching for the given string at the current cursor location. It then proceeds to the end of the file. If it has not found the string by that time, it starts from the beginning and searches from the start of the file to the cursor location. Keep in mind that when repeating the "n" command to search for the next match, you eventually get back to the first match. If you don't notice this you keep searching forever! To give you a hint, Vim displays this message:
es_es: Por omisión, una búsqueda hacia adelante se inicia buscando la cadena dada en la ubicación presente del cursor. Después continua hasta el final del archivo. Si no ha encontrado ninguna cadena, vuelve al inicio y busca desde el principio del archivo. Tenga en cuenta que, de repetir la orden «n» para buscar la siguiente coincidencia, al final volverá a la primera. ¡Buscará para siempre si no nota esto! Vim le da una pista con la forma del siguiente mensaje:

source: search hit BOTTOM, continuing at TOP ~
es_es: La búsqueda ha llegado al FINAL, continuando desde el PRINCIPIO ~

source: search hit TOP, continuing at BOTTOM ~
es_es: La búsqueda ha llegado al FINAL, continuando desde el PRINCIPIO ~

source: Still, you don't know when you are back at the first match. One way to see this is by switching on the 'ruler' option: >
es_es: Aún así,no sabe cuando vuelve a la primera coincidencia. Una forma de ver esto es activando la opción 'ruler'.

source: Vim will display the cursor position in the lower righthand corner of the window (in the status line if there is one). It looks like this:
es_es: Muestra siempre la posición actual en la esquina inferior derecha de la ventana (en la línea de estado, de existir). Presenta este aspecto:

source: The first number is the line number of the cursor. Remember the line number where you started, so that you can check if you passed this position again.
es_es: El primer número es el número de la línea del cursor. Recuerde el número de la línea inicial, de manera pueda comprobar si ya pasó por esta posición.

source: E385: search hit BOTTOM without match for: forever ~
es_es: E385: La búsqueda ha llegado al FINAL sin una coincidencia para: forever ~

source: Thus you can find all matches by going to the start of the file with "gg" and keep searching until you see this message. If you search in the other direction, using "?", you get:
es_es: Así, puede encontrar todas las coincidencias desplazándose al inicio del archivo con «gg», y buscar hasta ver este mensaje. Si busca en otra dirección, usando, «?», obtendrá:

source: E384: search hit TOP without match for: forever ~
es_es: E385: La búsqueda ha llegado al PRINCIPIO sin una coincidencia para: forever ~

source: *27.3* Offsets
es_es: *27.3* Dirección relativa («Offsets»)

source: By default, the search command leaves the cursor positioned on the beginning of the pattern. You can tell Vim to leave it some other place by specifying an offset. For the forward search command "/", the offset is specified by appending a slash (/) and the offset: >
es_es: Por omisión, la orden de búsqueda posiciona el cursor al inicio del patrón. Puede hacer que Vim lo posicione en algún lugar especificando una dirección relativa. Para la orden de búsqueda hacia delante «/», la dirección relativa se especifica añadiendo una barra inversa («/») y la dirección relativa: >

source: /default/2
es_es: /omisión/2

source: This command searches for the pattern "default" and then moves to the beginning of the second line past the pattern. Using this command on the paragraph above, Vim finds the word "default" in the first line. Then the cursor is moved two lines down and lands on "an offset".
es_es: Esta orden busca el patrón «omisión», y después se desplaza al inicio de la segunda línea, más allá del patrón. De usar esta orden en el párrafo anterior, Vim encontraría la palabra «omisión» en la primera línea. Acto seguido, el cursor se posicionaría dos líneas más abajo, para acabar en la dirección relativa.
